Feature: 报价

  Background:
    Given 物流后台发布一条需求
    When 进入"待报价"页面
    Then 目前至少有一个"待报价"的订单

  @quotate
  Scenario: 含税总价为空检验
    When 进入"报价"页面
    Then 报价:
      | 含税总价 | 含税单价| 不含税总价 | 不含税单价|
      |          | 5214.50 | 59785.12  | 4931.54 |
    Then 应有toast弹出"含税总价不能为空"

  @quotate
  Scenario: 含税单价为空检验
    When 进入"报价"页面
    Then 报价:
      | 含税总价 | 含税单价| 不含税总价 | 不含税单价|
      | 62124.35 |         | 59785.12  | 4931.54 |
    Then 应有toast弹出"含税单价不能为空"

  @quotate
  Scenario: 不含税总价为空检验
    When 进入"报价"页面
    Then 报价:
      | 含税总价 | 含税单价| 不含税总价 | 不含税单价|
      | 62124.35| 5214.50 |             | 4931.54 |
    Then 应有toast弹出"不含税总价不能为空"

  @quotate
  Scenario: 不含税单价为空检验
    When 进入"报价"页面
    Then 报价:
      | 含税总价 | 含税单价| 不含税总价 | 不含税单价|
      | 62124.35 | 5214.50 | 59785.12  |           |
    Then 应有toast弹出"不含税单价不能为空"

  @quotate
  Scenario Outline: 输入总价/单价自动计算出对应单价/总价检验
    Then 进入"报价"页面
    Then 输入"<含税总价>"应自动计算出"含税单价"
    Then 输入"<含税单价>"应自动计算出"含税总价"
    Then 输入"<不含税总价>"应自动计算出"不含税单价"
    Then 输入"<不含税单价>"应自动计算出"不含税总价"

    Examples:
      | 含税总价 | 含税单价| 不含税总价 | 不含税单价|
      | 62124.35 | 5214.50 | 59785.12  | 4931.54 |

  @quotate
  Scenario: 含税总价整数超过10位toast检验
    When 进入"报价"页面
    Then 输入"含税总价""12345678901"
    Then 应有toast弹出"含税总价超出最大范围"

  @quotate
  Scenario: 不含税总价整数超过10位toast检验
    When 进入"报价"页面
    Then 输入"不含税总价""12345678901"
    Then 应有toast弹出"不含税总价超出最大范围"

  @quotate
  Scenario: 含税单价整数超过5位toast检验
    When 进入"报价"页面
    Then 输入"含税单价""123456"
    Then 应有toast弹出"含税单价超出最大范围"

  @quotate
  Scenario: 不含税单价整数超过5位toast检验
    When 进入"报价"页面
    Then 输入"不含税单价""123456"
    Then 应有toast弹出"不含税单价超出最大范围"

  @quotate
  Scenario: 价钱小数点后超过2位无法输入检验
    When 进入"报价"页面
    Then 输入"含税总价""621.351"并检验小数点后数位
    Then 输入"不含税总价""52.502"并检验小数点后数位
    Then 输入"含税单价""597.122"并检验小数点后数位
    Then 输入"不含税单价""49.541"并检验小数点后数位

  @quotate
  Scenario: 报价正常流程
    When 进入"报价"页面
    Then 报价:
      | 含税总价 | 含税单价| 不含税总价 | 不含税单价|
      | 62124.35 | 5214.50 | 59785.12  | 4931.54 |
    Then 我应该在"待报价"页

  @quotate
  Scenario: 修改报价正常流程
    When 进入"我的报价"页面
    Then 目前至少有一个"可修改报价"的订单
    When 进入修改报价页修改报价信息:
      | 含税总价 | 不含税总价 |
      | 78756.12| 647476.34 |
    Then 我应该在"我的报价"页


